Fix Readme File Error and add .gitignore
